import Vue from 'vue'
import Vuex from 'vuex'

Vue.use(Vuex)

export default new Vuex.Store({
  state: {
    library: [],
    report: {
      name: 'Корневой элемент',
      children: [
        {
          id: 8,
          data: [46864, 46773, 48725, 48607, 47425, 46255, 44564, 42888, 45821, 41433, 43528, 44564],
          labels: ["06.2019","05.2019","04.2019","03.2019","02.2019","01.2019","12.2018","11.2018","10.2018","09.2018","08.2018","07.2018"],
          name: 'Средняя заработная плата',
          val1: 42000,
          val2: 45000,
          link: 'salary',
          children: [
            {
              id: 81,
              data: [43528, 44564],
              labels: ["мыжчины", "женщины"],
              name: 'Средняя зарплата по полу',
              val1: 42000,
              val2: 45000,
              link: 'sex',
              children: [
                {
                  id: 82,
                  data: [43528, 44564, 42888, 45821, 41433, 43528, 44564, 42888, 45821, 41433, 43528, 44564],
                  labels: ["06.2019","05.2019","04.2019","03.2019","02.2019","01.2019","12.2018","11.2018","10.2018","09.2018","08.2018","07.2018"],
                  name: 'Средняя зарплата: мужчины',
                  val1: 42000,
                  val2: 45000,
                  link: 'man'
                },
                {
                  id: 83,
                  data: [43528, 44564, 42888, 45821, 41433, 43528, 44564, 42888, 45821, 41433, 43528, 44564],
                  labels: ["06.2019","05.2019","04.2019","03.2019","02.2019","01.2019","12.2018","11.2018","10.2018","09.2018","08.2018","07.2018"],
                  name: 'Средняя зарплата: женщины',
                  val1: 42000,
                  val2: 45000,
                  link: 'woman'
                }
              ]
            },
            {
              id: 84,
              data: [43528, 45564, 44564],
              labels: ["18-35", "36-50", "51+"],
              name: 'Средняя зарплата по возрасту',
              val1: 42000,
              val2: 45000,
              link: 'ages',
              children: [
                {
                  id: 85,
                  data: [43528, 44564, 42888, 45821, 41433, 43528, 44564, 42888, 45821, 41433, 43528, 44564],
                  labels: ["06.2019","05.2019","04.2019","03.2019","02.2019","01.2019","12.2018","11.2018","10.2018","09.2018","08.2018","07.2018"],
                  name: 'Средняя зарплата по возрасту: 18-35',
                  val1: 42000,
                  val2: 45000,
                  link: 'ages18'
                },
                {
                  id: 86,
                  data: [43528, 44564, 42888, 45821, 41433, 43528, 44564, 42888, 45821, 41433, 43528, 44564],
                  labels: ["06.2019","05.2019","04.2019","03.2019","02.2019","01.2019","12.2018","11.2018","10.2018","09.2018","08.2018","07.2018"],
                  name: 'Средняя зарплата по возрасту: 36-50',
                  val1: 42000,
                  val2: 45000,
                  link: 'ages36'
                },
                {
                  id: 87,
                  data: [43528, 44564, 42888, 45821, 41433, 43528, 44564, 42888, 45821, 41433, 43528, 44564],
                  labels: ["06.2019","05.2019","04.2019","03.2019","02.2019","01.2019","12.2018","11.2018","10.2018","09.2018","08.2018","07.2018"],
                  name: 'Средняя зарплата по возрасту: 51+',
                  val1: 42000,
                  val2: 45000,
                  link: 'ages50'
                }
              ]
            },
            {
              id: 88,
              data: [38637, 39431, 49699],
              labels: ["ППМ", "ПСЦМ", "Уралэлектромедь"],
              name: 'Средняя зарплата по площадкам',
              val1: 42000,
              val2: 45000,
              link: 'platform',
              children: [
                {
                  id: 89,
                  data: [43528, 44564, 42888, 45821, 41433, 43528, 44564, 42888, 45821, 41433, 43528, 44564],
                  labels: ["06.2019","05.2019","04.2019","03.2019","02.2019","01.2019","12.2018","11.2018","10.2018","09.2018","08.2018","07.2018"],
                  name: 'Средняя зарплата по площадкам: Уралэлектромедь',
                  val1: 42000,
                  val2: 45000,
                  link: 'uem'
                },
                {
                  id: 80,
                  data: [43528, 44564, 42888, 45821, 41433, 43528, 44564, 42888, 45821, 41433, 43528, 44564],
                  labels: ["06.2019","05.2019","04.2019","03.2019","02.2019","01.2019","12.2018","11.2018","10.2018","09.2018","08.2018","07.2018"],
                  name: 'Средняя зарплата по площадкам: ПСЦМ',
                  val1: 42000,
                  val2: 45000,
                  link: 'pscm'
                },
                {
                  id: 811,
                  data: [43528, 44564, 42888, 45821, 41433, 43528, 44564, 42888, 45821, 41433, 43528, 44564],
                  labels: ["06.2019","05.2019","04.2019","03.2019","02.2019","01.2019","12.2018","11.2018","10.2018","09.2018","08.2018","07.2018"],
                  name: 'Средняя зарплата по площадкам: ППМ',
                  val1: 42000,
                  val2: 45000,
                  link: 'ppm'
                }
              ]
            }
          ]
        }
      ],
      data: []
    }
  },
  mutations: {
    library (state, data) {
      state.library = data
    },
    report (state, data) {
      state.report = data
    }
  },
  actions: {},
  getters: {
    library: state => Object.assign(state.library),
    report: state => Object.assign(state.report)
  }
})
